Белгипрозем_2017/src/InformationRegisters/НастройкиУведомленийПоУмолчанию/НастройкиУведомленийПоУмолчанию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУведомленийПоУмолчанию</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>EnumRef.НастройкиУведомлений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСобытия</name>
    <type>
      <types>CatalogRef.ВидыБизнесСобытий</types>
      <types>EnumRef.СобытияУведомлений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/ПодпискиНаУведомления/ПодпискиНаУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодпискиНаУведомления</name>
  <resources>
    <name>ПодпискаАктивна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидСобытия</name>
    <type>
      <types>CatalogRef.ВидыБизнесСобытий</types>
      <types>EnumRef.СобытияУведомлений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПодписки</name>
    <type>
      <types>CatalogRef.ТемыОбсуждений</types>
      <types>CatalogRef.Контроль</types>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ПапкиФайлов</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.КатегорииДанных</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
      <types>BusinessProcessRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособУведомления</name>
    <type>
      <types>EnumRef.СпособыУведомления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/НастройкиУведомлений/НастройкиУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НастройкиУведомлений</name>
  <enumValues>
    <name>ВыполнениеЗадачПоПочте</name>
  </enumValues>
  <enumValues>
    <name>Подписка</name>
  </enumValues>
  <enumValues>
    <name>ПроцентноеИзменение</name>
  </enumValues>
  <enumValues>
    <name>СрокУведомления</name>
  </enumValues>
  <enumValues>
    <name>УведомленияПрограммы</name>
  </enumValues>
  <enumValues>
    <name>ЧастотаУведомления</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/ПотребителиБизнесСобытий/ПотребителиБизнесСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПотребителиБизнесСобытий</name>
  <enumValues>
    <name>АвтоматическийЗапускБизнесПроцессов</name>
  </enumValues>
  <enumValues>
    <name>ПользовательскаяОбработкаСобытий</name>
  </enumValues>
  <enumValues>
    <name>РассылкаУведомлений</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/InformationRegisters/НастройкиУведомленийПоУмолчанию/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() = 1 Тогда
		
		ЭлементЗаписи = Получить(0);
		Настройка = ЭлементЗаписи.Настройка;
		ВидСобытия = ЭлементЗаписи.ВидСобытия;
		Значение = ЭлементЗаписи.Значение;
		Если Настройка <> Перечисления.НастройкиУведомлений.Подписка
			ИЛИ ТипЗнч(ВидСобытия) <> Тип("СправочникСсылка.ВидыБизнесСобытий")
			ИЛИ ТипЗнч(Значение) <> Тип("Булево")
			ИЛИ Значение <> Истина Тогда
			Возврат;
		КонецЕсли;
		
		БизнесСобытияВызовСервера.СохранитьПодпискуНаБизнесСобытия(ВидСобытия, 
			Перечисления.ПотребителиБизнесСобытий.РассылкаУведомлений);
		
	ИначеЕсли Количество() = 0 Тогда // удаление
		
		Если ТипЗнч(ЭтотОбъект.Отбор.ВидСобытия.Значение) <> Тип("СправочникСсылка.ВидыБизнесСобытий") Тогда
			Возврат;
		КонецЕсли;
		
		КоличествоПодписчиков = ПолучитьКоличествоПодписчиков(ЭтотОбъект.Отбор.ВидСобытия.Значение);
		
		Если КоличествоПодписчиков = 0 Тогда
			БизнесСобытияВызовСервера.УдалитьПодпискуНаБизнесСобытия(ЭтотОбъект.Отбор.ВидСобытия.Значение, 
				Перечисления.ПотребителиБизнесСобытий.РассылкаУведомлений);
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКоличествоПодписчиков(ВидСобытия)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПодпискиНаУведомления.ВидСобытия КАК ВидСобытия
		|ИЗ
		|	РегистрСведений.ПодпискиНаУведомления КАК ПодпискиНаУведомления
		|ГДЕ
		|	ПодпискиНаУведомления.ВидСобытия = &ВидСобытия
		|	И ПодпискиНаУведомления.ПодпискаАктивна = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НастройкиУведомленийПоУмолчанию.ВидСобытия
		|ИЗ
		|	РегистрСведений.НастройкиУведомленийПоУмолчанию КАК НастройкиУведомленийПоУмолчанию
		|ГДЕ
		|	НастройкиУведомленийПоУмолчанию.Настройка = ЗНАЧЕНИЕ(Перечисление.НастройкиУведомлений.Подписка)
		|	И НастройкиУведомленийПоУмолчанию.ВидСобытия = &ВидСобытия
		|	И НастройкиУведомленийПоУмолчанию.Значение = ИСТИНА";
	
	Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Возврат Таблица.Количество();
	
КонецФункции

#КонецОбласти
